MusicApp/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "aagamvakil@hotmail.com"], ["password_digest", "$2a$12$94ZTnM31Tt99ifZSnPOqOObVUnoKjlOBX0rwTNLNz0BhS/6T8lPJO"], ["session_token", "EesHwO61rtzVoOoDM1yKkg"]]